# 1.
# Создать два списка произвольного содержания.
# Добавить к каждому списку по одному элементу в конец и в начало.
# Расширить первый список вторым.
# Все изменения выводить на экран.

list_1 = [1, 2, 3, 4]
list_2 = ['spring', 'summer', 'autumn']
print(list_1, list_2)
list_1.append(5)
list_2.append('winter')
print(list_1, list_2)
list_1.insert(0, 0)
list_2.insert(0, 'winter')
print(list_1, list_2)
list_1.extend(list_2)
print(list_1, list_2)

# Создать два списка, с одинаковым кол-вом элементов. Сделать из этих списков словарь.
list_3 = [1, 2]
list_4 = ['a', 'b']
dict_first = dict([list_3, list_4])
print(dict_first)

# Работа с Дзен Python
# Количество строк: Определите количество строк в Дзене Питона.
# Ключевые слова: Подсчитайте количество вхождений ключевых cлов из Дзена Питона, таких как "is", "and", "or".
# cложить в словарь такого типа {“is”: 4, “and”: None, “or”: 100}
# Замена словa: Замените все вхождения слова "is" в Дзене Питона на "is nothing

import this



















































